
//function setup() {
//    createCanvas(400, 400);
//  }
//
//function draw(){
   // background(200);
   // fill(0, 200, 0);
   // circle(50, 50, 75);
  //  fill(200, 0, 0);
   // circle(125, 125, 75);
   // fill(200, 0, 0);
   // circle(200, 200, 75);
   // fill(0, 0, 200);
   // circle(275, 275, 75);//
    
//}

//function draw() {
   // fill(200, 0, 0);
   // circle(50, 50, 75);
   // fill(0, 200, 0);
   // circle(50, 50, 50);
//
   // fill(0, 0, 200);
   // circle(125, 125, 75);
   // fill(300, 300 ,300);
   // circle(125, 125, 50);
//
   // fill(0, 200, 0);
   // circle(200, 200, 75);


//function draw(){
//background(200,255,255)
//fill(300, 300, 300);
//    circle(200, 300, 200);
//    fill(300, 300, 300);
//    circle(200, 175, 150);
//    fill(300, 300, 300);
//    circle(200, 75, 100);
//
//
//
//


function setup() {
    createCanvas(600, 600);
    background(200, 220, 255); // небо
  }
  
  function draw() {
    noStroke();
  
    // Земля
    fill(200, 150, 100);
    rect(0, 400, width, ); // земля
  
    // Дом
    fill(240, 180, 100); // цвет стен
    rect(100, 250, 200, 150); // основной корпус дома
  
    // Крыша
    fill(100mou, 50, 0); // крыша
    triangle(80, 250, 320, 250, 200, 150); // треугольная крыша
  
   
  
    // Окна
    fill(255); // окна
    rect(130, 280, 40, 40); // левое окно
   
  
    // Ставни на окнах
    fill(100, 50, 0); // ставни
    
  
    // Дверь
    fill(100, 50, 0); // цвет двери
    rect(190, 340, 30, 60); // дверь
  
    
  
    
  


    noLoop(); // остановить отрисовку
  }
  
  

